{

    "lang" : "French",

    "nav-link-1" : "Home / Projects",
    "nav-link-2" : "About",


    "main-page-hero-title" : "Nice to meet you, I'm <span>Maxime</span>",

    "main-page-hero-text" : "I am a web developer with a passion for user experience. From the initial design to the final product, I enjoy designing interfaces that are adapted to users' needs.",
    "main-page-hero-btn-text" : "View my projects",
    "main-page-hero-image-caption" : "that's me !",
    "main-page-hero-contact-me" : "Contact-me ! :)",

    "main-page-testimonies-title" : "What others have to say",
    "main-page-testimonies-samia-text" : "I tasked Maxime with creating Figma prototypes when I was starting my business. I was not disappointed : I found Maxime to be an attentive listener, offering rigorous and impeccable work as well as advice ! I recommend his work and his professionalism ! Thanks again Maxime!",
    "main-page-testimonies-samia-caption" : "Samia EL FAROUKI : Awake Tissu founder",

    "main-page-testimonies-agilemans-text" : "Maxime took care of the redesign of our aging website this year using more modern and responsive techniques. The whole team of the association was enthusiastic about the change.",
    "main-page-testimonies-agilemans-caption" : "AgiLeMans association",

    "main-page-testimonies-corentin-text" : "I worked with Maxime on the redesign of our alumni association's website. He took the initiative to propose relevant solutions, while listening to the ideas of others, and keeps on maintaining the website since then !",
    "main-page-testimonies-corentin-caption" : "Corentin B. - PhD Engineer",

    "main-page-project-title" : "My <span>projects</span>",

    "main-page-project-agilemans-type" : "Showcase website",
    "main-page-project-agilemans-title" : "AgiLeMans",

    "main-page-project-livrotheque-type" : "Book loan",
    "main-page-project-livrotheque-title" : "Livrothèque",

    "main-page-project-awaketissu-type" : "UX / UI",
    "main-page-project-awaketissu-title" : "Awake Tissu",

    "main-page-project-vavart-type" : "Discord bot",
    "main-page-project-vavart-title" : "Vavart",

    "main-page-project-sphere-type" : "Showcase website",
    "main-page-project-sphere-title" : "SPHERE",

    "main-page-next-page-text" : "Want to know more about me ?",

    "about-page-hero-title" : "I am (soon to become) an engineer specializing in person / system <span>interactions</span>",
    "about-page-hero-text" : "Currently in my 4th year of computer engineering studies, I am also learning a lot on my own. I like reading and acquiring new knowledge every day, always with the aim of improving myself. Finally, I have made it my mission to make users' lives easier, in order to help them progress and save time. Everyone hates to waste their time on poor interfaces !",
    "about-page-hero-in-short" : "In a nutshell :",
    "about-page-hero-in-short-text" : "Developing interfaces that make <span>sense</span>",

    "about-page-hero-tag-1-title" : "#web",
    "about-page-hero-tag-1-text" : "My favorite development world !",
    "about-page-hero-tag-2-title" : "#music",
    "about-page-hero-tag-2-text" : "For every mood !",
    "about-page-hero-tag-3-title" : "#entrepreneurship",
    "about-page-hero-tag-3-text" : "If only you knew how much I love creating things ...",
    "about-page-hero-tag-4-title" : "#ergonomic",
    "about-page-hero-tag-4-text" : "If everyone thinks about it, the world will go in the right direction !",
    "about-page-hero-tag-5-title" : "#responsive",
    "about-page-hero-tag-5-text" : "It has to look good on your phone !",
    "about-page-hero-tag-6-title" : "#agility",
    "about-page-hero-tag-6-text" : "Useful principles for a better life.",
    "about-page-hero-tag-7-title" : "#uxdesign",
    "about-page-hero-tag-7-text" : "Customer happiness is the priority !",
    "about-page-hero-tag-8-title" : "#developer",
    "about-page-hero-tag-8-text" : "Despite what I can say about it, I still love it so much !",
    "about-page-hero-tag-9-title" : "#reading",
    "about-page-hero-tag-9-text" : "If you have a problem, someone has probably already written about it !",
    "about-page-hero-tag-10-title" : "#vision",
    "about-page-hero-tag-10-text" : "To make sure you're always moving in the right direction !",


    "about-page-skills-title" : "My skills",
    "about-page-skills-languages-text" : "The <span>languages</span> and <span>frameworks</span> that I use",
    "about-page-skills-tools-text" : "My main <span>tools</span> (web & design)",
    "about-page-skills-soft-title" : "My <span>soft</span> skills",
    "about-page-skills-soft-1" : "Perseverance",
    "about-page-skills-soft-2" : "Emotional intelligence",
    "about-page-skills-soft-3" : "Creativity",
    "about-page-skills-soft-4" : "Communication",
    "about-page-skills-soft-5" : "Leadership",
    "about-page-skills-soft-6" : "Think out of the box",
    "about-page-skills-soft-7" : "Team spirit",
    "about-page-skills-soft-8" : "Critical thinking",
    "about-page-skills-soft-9" : "Curiosity",
    "about-page-skills-hard-title" : "My <span>hard</span> skills",
    "about-page-skills-hard-1" : "Problem solving",
    "about-page-skills-hard-2" : "Agility, Scrum, SAFe",
    "about-page-skills-hard-3" : "Entrepreneurship",
    "about-page-skills-hard-4" : "UX/UI Design",
    "about-page-skills-hard-5" : "UX Writing",
    "about-page-skills-hard-6" : "Web design",
    "about-page-skills-hard-7" : "Web development",
    "about-page-skills-hard-8" : "Continuous integration",
    "about-page-skills-hard-9" : "Responsive design",
    "about-page-skills-contact-title" : "Contact me",
    "about-page-skills-contact-btn-linkedin" : "Open LinkedIn profile",
    "about-page-skills-contact-btn-cv" : "Download my CV",
    "about-page-next-page-text" : "Let's go back to my projects ?",


    "project-page-role" : "My role",
    "project-page-process" : "Process",
    "project-page-techs" : "Tools & technologies",
    "project-page-next-page" : "Back to my projects ?",


    "project-page-agilemans-title" : "<span>AgiLeMans<span>",
    "project-page-agilemans-subtitle" : "Agility days in Sarthe !",
    "project-page-agilemans-summary" : "AgiLeMans is an association that promotes the merits and benefits of agility in Sarthe. Every year, the association organizes its Agile day where hundreds of people come to discover or re-discover methods to be happier and more efficient at work. I'm part of AgiLeMans since 2021 where I realized a good part of their communication and this website (link at the bottom of the page).",
    "project-page-agilemans-catch-phrase" : "The AgiLemans website was quite a challenge for me, having no knowledge of continuous integration. I was going into the unknown.",
    "project-page-agilemans-role-text" : "The purpose was to update the old website of the association by proposing a new and ergonomic style while facilitating its management by the members of the association. A particular attention was paid to the adaptation of the site on different types of screens (responsive) and to the speed of it.",
    "project-page-agilemans-process-text" : "I first realized the whole design on Figma as usual before justifying to the association the technology I was going to use, Next.js. This JavaScript framework is indeed the first thing I thought of to answer the speed criterion. It adds image optimization and static page rendering to React. Instead of hydrating the site dynamically with JavaScript, static HTML pages are generated, allowing at the same time to better index the site on search engines. What to make AgiLeMans known to the greatest number ! Finally, the original website was using continuous integration and development practices with GitLab (CI / CD). Since I had no knowledge of this topic, I was able to benefit from the experience of the site's maintainer who taught me the basics of this approach.",
    "project-page-agilemans-cta-text" : "Visit the website",


    "project-page-livrotheque-title" : "The <span>Livrothèque<span>",
    "project-page-livrotheque-subtitle" : "A library website for curious readers !",
    "project-page-livrotheque-summary" : "This dummy website is a project I led during my studies. The goal was to develop a full-stack interface. The Livrothèque allows users to borrow books from the library through the site's interface. An administrator part is available for the managers of the library in order to manage the stock (order, book edition, deletion) and the borrowing of the customers.",
    "project-page-livrotheque-catch-phrase" : "Although I had developed many front-end interfaces in the past, this project was my first experience with the back-end.",
    "project-page-livrotheque-role-text" : "As a student, my goal was to discover how to link (for the first time) a database to a static website. The challenge was big but very rewarding. Developing a complete project allows to concretely implement the skills acquired in the past and to progress.",
    "project-page-livrotheque-process-text" : "As usual I first realized the whole design of the site on Figma before moving to the implementation of the database. The relations were quite simple to set up, the objective was mainly to learn how to integrate this database to the site using PHP. The rest of the project is quite linear, I first developed the whole static front-end part (including responsive) before integrating the PHP and SQL queries. Having still some time available before the final rendering, I was able to implement a login system with the possibility to update his personal information. A long project to do alone, but very rewarding afterwards.",
    "project-page-livrotheque-cta-text" : "View on GitHub",

    "project-page-awaketissu-title" : "Awake <span>Tissu<span>",
    "project-page-awaketissu-subtitle" : "The application for buying and selling second hand fabrics !",
    "project-page-awaketissu-summary" : "Awake Tissu is an entrepreneurial project led by a friend, Samia El Farouki. Born from an idea to fight against textile overproduction, this project aims to develop a platform to connect sewing enthusiasts. I was able to develop the whole design of the new 'Vinted of sewing'.",
    "project-page-awaketissu-catch-phrase" : "In almost 5 years of Figma practice, the design of Awake Tissu is the most significant I have ever done.",
    "project-page-awaketissu-role-text" : "I particularly appreciate the Figma tool to create visuals and prototypes of websites and applications. Therefore, it is without hesitation that I decided to assist Samia in the creation of her online platform. The design of the application is a crucial step of the project, it is the last before its concrete development. Nothing should be forgotten.",
    "project-page-awaketissu-process-text" : "Indeed, this mock-up is the last step before the development and deployment of the application. Starting from Samia's ideas and sketches, I started a UX approach in order to offer the best possible experience. The work consisted in understanding the personas, making low and high fidelity prototypes as well as thinking about the interactions. From there and with a regular communication, I designed step by step each screen of the application on Figma. This project was a very fulfilling experience both in terms of my skills and the pleasure I took in designing a concrete entrepreneurial project.",
    "project-page-awaketissu-cta-text" : "Visit the application (coming soon)",

    "project-page-vavart-title" : "<span>Vavart<span>",
    "project-page-vavart-subtitle" : "A discord bot to organize your private games in Rainbow Six : Siege !",
    "project-page-vavart-summary" : "When you meet your friends to play, it's not to spend 20 minutes discussing teams, the map to play on, or how to vocally separate yourself from the others ! Vavart is the solution to all this, it allows you to automate the creation of private games of Rainbow Six: Siege (R6) on discord by generating a map and random teams. It even allows you to vocally separate the two teams in different rooms and bring them back together at the end of the game. Enough to easily play an extra game !",
    "project-page-vavart-catch-phrase" : "A first experience with discord.js that opens doors to other ways of using web languages.",
    "project-page-vavart-role-text" : "I had noticed that we were spending a lot of time (too much) to organize ourselves to play together with friends. So I decided to create this discord bot to answer this problem. The bot had to be fun and easy to use to organize games quickly.",
    "project-page-vavart-process-text" : "Vavart is my very first discord bot ! I didn't know where this project was going to take me, I just wanted to speed up the creation of private games to play longer without having to take too much time to agree between friends. I proceeded by iterations. The first goal was to get a first working version to play as soon as possible. Only in a second and third version I added message formatting and other features such as moving players into team voice chat rooms. The design in JavaScript was interesting and fun to implement, it's a lanagage that I really like.",
    "project-page-vavart-cta-text" : "View on GitHub",

    "project-page-sphere-title" : "<span>SPHERE<span>",
    "project-page-sphere-subtitle" : "My school's alumni association !",
    "project-page-sphere-summary" : "SPHERE is the ENSIM alumni association of my school. I made my first steps in November 2021 following their annual day. As AgiLeMans, I was in charge of the communication of the association by creating visuals and posts on social networks but I especially participated in the redesign of the website!",
    "project-page-sphere-catch-phrase" : "A great collaboration for my first experience with Wordpress !",
    "project-page-sphere-role-text" : "In this case, I worked in collaboration with Corentin B. a member of the association. The goal was to propose a new website that would be efficient and easily maintainable by people who are not necessarily developers.",
    "project-page-sphere-process-text" : "The choice of technology was made in favor of Wordpress. It is a free content management system, easy to integrate into a website. It allows you to create and maintain sites easily using its system of blocks of content. Furthermore, a blog part is naturally integrated, which facilitates anyone to publish articles without having to touch a single line of code. A handy technology that allows you to design sites / blogs quickly. Nevertheless, having the habit of developing each of my sites by hand, I was often frustrated by the lack of customization provided by the tool.",
    "project-page-sphere-cta-text" : "Go on the website",

    

    
    "legal-title" : "<span>Legal</span> notices",
    "legal-edition-title" : "Website edition",
    "legal-edition-text" : "The site https://maximesciare.com (hereinafter 'the Site') is edited by Maxime Sciare (hereinafter 'the Editor').",
    "legal-redaction-title" : "Website redaction",
    "legal-redaction-text-1" : "Director of the publication : Maxime Sciare",
    "legal-redaction-text-2" : "Contact: contact@maximesciare.com",
    "legal-hosting-title" : "Website hosting",
    "legal-hosting-text" : "The site https://maximesciare.com is hosted by OVH, 2 Kellermann street, 59100 Roubaix.",
    "legal-respect-title" : "Respect for intellectual property",
    "legal-respect-text-1" : "All trademarks, photographs, texts, comments, illustrations, animated or non-animated images, video sequences, sounds, as well as all computer applications that may be used to operate the Site and, more generally, all elements reproduced or used on the Site are protected by the laws in force with respect to intellectual property.",
    "legal-respect-text-2" : "They are the full and complete property of the Publisher or its partners, unless otherwise specified. Any reproduction, representation, use or adaptation, in any form whatsoever, of all or part of these elements, including computer applications, without the prior written consent of the Publisher, is strictly prohibited. The Publisher's failure to take action upon becoming aware of such unauthorized use does not constitute acceptance of such use or a waiver of such action.",
    "legal-respect-text-3" : "Only private use within the family circle is permitted and any other use constitutes an infringement of copyright and/or neighbouring rights, punishable under the Intellectual Property Code.",
    "legal-respect-text-4" : "The use of all or part of this content requires the prior authorization of the Publisher or the holder of the rights to this content.",
    "legal-links-title" : "Hypertext links",
    "legal-links-text" : "The Site may contain hyperlinks to other Internet sites published and managed by third parties and not by the Publisher. The Editor cannot be held responsible directly or indirectly in the event that the said third-party sites do not comply with the legal provisions.",


    "footer-text" : "©2023 - Developed by me with ❤️",
    "footer-legal" : "Legal notices"
}