{

    "lang" : "Anglais",

    "nav-link-1" : "Accueil / Projets",
    "nav-link-2" : "À propos",


    "main-page-hero-title" : "Enchanté, moi c'est <span>Maxime</span>",

    "main-page-hero-text" : "Je suis un développeur web passionné par l'expérience utilisateur. Du design initial au produit final, j'apprécie énormément concevoir des interfaces adaptées aux besoins des utilisateurs.",
    "main-page-hero-btn-text" : "Voir mes projets",
    "main-page-hero-image-caption" : "c'est moi !",
    "main-page-hero-contact-me" : "Contactez-moi ! :)",

    "main-page-testimonies-title" : "Ils m'ont fait confiance",
    "main-page-testimonies-samia-text" : "J'ai fait confiance à Maxime pour la réalisation de prototypes sur FIGMA, dans le cadre de la création de mon entreprise ! Je n'ai pas été déçue : j'ai retrouvé chez Maxime une oreille attentive, des conseils et un travail rigoureux et irréprochable ! Je recommande son travail et son professionnalisme ! Encore merci Maxime !",
    "main-page-testimonies-samia-caption" : "Samia EL FAROUKI : Fondatrice d'Awake Tissu",

    "main-page-testimonies-agilemans-text" : "Maxime s'occupa de la refonte de notre site web vieillissant cette année en utilisant des techniques plus modernes et réactives. Toute l'équipe de l'association fut enthousiasmée par le changement.",
    "main-page-testimonies-agilemans-caption" : "L'association AgiLeMans",

    "main-page-testimonies-corentin-text" : "J'ai travaillé avec Maxime sur la refonte du site web de notre association d'alumni. Il a fait preuve d'initiative pour proposer des solutions pertinentes, tout en sachant rester à l'écoute des idées des autres, et continue à maintenir le site depuis !",
    "main-page-testimonies-corentin-caption" : "Corentin B. - Ingénieur PhD",

    "main-page-testimonies-alice-text" : "J'ai eu l'occasion de travailler avec Maxime pour réaliser des supports de communication dans le cadre de deux associations (affiches, visuels pour les réseaux sociaux, plaquette de sponsoring...). Maxime a le sens du détail et sait être force de proposition tout en faisant preuve d'une grande écoute. C'est avec plaisir que je continuerai à travailler avec lui !",
    "main-page-testimonies-alice-caption" : "Alice Delbecque - Scrum Master à Extia",

    "main-page-project-title" : "Mes <span>projets</span>",

    "main-page-project-agilemans-type" : "Site web vitrine",
    "main-page-project-agilemans-title" : "AgiLeMans",

    "main-page-project-livrotheque-type" : "Emprunts de livres",
    "main-page-project-livrotheque-title" : "Livrothèque",

    "main-page-project-awaketissu-type" : "UX / UI",
    "main-page-project-awaketissu-title" : "Awake Tissu",

    "main-page-project-sphere-type" : "Site web vitrine",
    "main-page-project-sphere-title" : "SPHERE",

    "main-page-project-vavart-type" : "Bot discord",
    "main-page-project-vavart-title" : "Vavart",

    "main-page-project-cineflix-type" : "Application mobile",
    "main-page-project-cineflix-title" : "Cineflix",

    
    "main-page-next-page-text" : "Vous souhaitez en savoir plus sur moi ?",

    "about-page-hero-title" : "Je suis (bientôt) ingénieur spécialisé en <span>interactions</span> personne / système",
    "about-page-hero-text" : "Actuellement en 4ème année d'études d'ingénierie informatique, j'apprends aussi beaucoup en autonomie. J'aime lire et acquérir de nouvelles connaisances chaque jour, toujours dans le but de m'améliorer. Enfin, je me suis donné pour mission de faciliter la vie des utilisateurs, afin de leur permettre de progresser et de gagner du temps. Tout le monde déteste perdre son temps à cause d'une mauvaise interface !",
    "about-page-hero-in-short" : "En résumé :",
    "about-page-hero-in-short-text" : "Développer des interfaces qui ont du <span>sens</span>",
    "about-page-hero-tag-1-title" : "#web",
    "about-page-hero-tag-1-text" : "Mon univers de développement préféré !",
    "about-page-hero-tag-2-title" : "#musique",
    "about-page-hero-tag-2-text" : "Pour toutes les émotions !",
    "about-page-hero-tag-3-title" : "#entrepreneurship",
    "about-page-hero-tag-3-text" : "Si vous saviez à quel point j'aime créer des choses ...",
    "about-page-hero-tag-4-title" : "#ergonomie",
    "about-page-hero-tag-4-text" : "Si chacun y pense, le monde ira dans le bon sens !",
    "about-page-hero-tag-5-title" : "#responsive",
    "about-page-hero-tag-5-text" : "Il faut que ça rende bien sur téléphone !",
    "about-page-hero-tag-6-title" : "#agilite",
    "about-page-hero-tag-6-text" : "Des principes biens utiles pour une vie meilleure.",
    "about-page-hero-tag-7-title" : "#uxdesign",
    "about-page-hero-tag-7-text" : "La satisfaction du client est la priorité !",
    "about-page-hero-tag-8-title" : "#developpeur",
    "about-page-hero-tag-8-text" : "Malgré ce que je peux en dire, j'adore toujours autant ça !",
    "about-page-hero-tag-9-title" : "#lecture",
    "about-page-hero-tag-9-text" : "Si tu as un problème, quelqu'un a sûrement déjà écrit à ce sujet !",
    "about-page-hero-tag-10-title" : "#vision",
    "about-page-hero-tag-10-text" : "Pour être toujours sûr d'avancer dans la bonne direction !",


    "about-page-skills-title" : "Mes compétences",
    "about-page-skills-languages-text" : "Les <span>langages</span> et <span>frameworks</span> que je pratique",
    "about-page-skills-tools-text" : "Mes <span>outils</span> principaux (web & design)",
    "about-page-skills-soft-title" : "Mes <span>soft</span> skills",
    "about-page-skills-soft-1" : "Pérsévérance",
    "about-page-skills-soft-2" : "Intelligence émotionnelle",
    "about-page-skills-soft-3" : "Créativité",
    "about-page-skills-soft-4" : "Communication",
    "about-page-skills-soft-5" : "Leadership",
    "about-page-skills-soft-6" : "Think out of the box",
    "about-page-skills-soft-7" : "Esprit d'équipe",
    "about-page-skills-soft-8" : "Esprit critique",
    "about-page-skills-soft-9" : "Curiosité",
    "about-page-skills-soft-10" : "Adaptation",
    "about-page-skills-hard-title" : "Mes <span>hard</span> skills",
    "about-page-skills-hard-1" : "Résolution de problèmes",
    "about-page-skills-hard-2" : "Agilité, Scrum, SAFe",
    "about-page-skills-hard-3" : "Entrepreneuriat",
    "about-page-skills-hard-4" : "UX/UI Design",
    "about-page-skills-hard-5" : "UX Writing",
    "about-page-skills-hard-6" : "Maquettage web",
    "about-page-skills-hard-7" : "Programmation web",
    "about-page-skills-hard-8" : "Intégration continue",
    "about-page-skills-hard-9" : "Responsive design",
    "about-page-skills-hard-10" : "Management",
    "about-page-skills-contact-title" : "Me contacter",
    "about-page-skills-contact-btn-linkedin" : "Voir le profil LinkedIn",
    "about-page-skills-contact-btn-cv" : "Télécharger le CV",
    "about-page-next-page-text" : "On retourne voir mes projets ?",


    "project-page-role" : "Mon rôle",
    "project-page-process" : "Déroulement",
    "project-page-techs" : "Technologies & outils",
    "project-page-next-page" : "Revenir à mes projets ?",


    "project-page-agilemans-title" : "<span>AgiLeMans<span>",
    "project-page-agilemans-subtitle" : "Les journées de l'agilité en Sarthe !",
    "project-page-agilemans-summary" : "AgiLeMans est une association qui vante les mérites et bienfaits de l'agilité en Sarthe. Chaque année, l'association organise sa journée Agile où des centaines de personnes viennent découvrir ou re-découvrir des méthodes pour être plus heureux et plus performant au travail. Je fais partie d'AgiLeMans depuis 2021 où j'ai réalisé une bonne partie de leur communication ainsi que ce site web (lien en bas de page).",
    "project-page-agilemans-catch-phrase" : "Le site web d'AgiLemans représentait un sacré défi pour moi, n'ayant aucune connaissance en intégration continue. Je me lançais un peu dans l'inconnu.",
    "project-page-agilemans-role-text" : "L'objectif était de mettre au goût du jour l'ancien site web de l'association en proposant un style neuf et ergonomique tout en facilitant sa gestion par les membres de l'asocciation. Une attention toute particulière était portée à l'adaptation du site sur différents types d'écrans (responsive) et à la vitesse de celui-ci.",
    "project-page-agilemans-process-text" : "J'ai premièrement réalisé l'ensemble du design sur Figma comme à mon habitude avant de justifier à l'association la technologie que j'allais utiliser, Next.js. Ce framework JavaScript est en effet la première chose à laquelle j'ai pensé pour répondre au critère de rapidité. Il ajoute à React l'optimisation des images et les rendus de page statiques. Au lieu d'hydater le site dynamiquement à l'aide de JavaScript, des pages HTML statiques sont générées, permettant par la même occasion de mieux indexer le site sur les moteurs de recherche. De quoi faire connaître AgiLeMans au plus grand nombre ! Enfin, le site web d'origine utilisait les pratiques d'intégration et de développement continu avec GitLab (CI / CD). N'ayant aucune connaissance à ce sujet, j'ai pu bénéficier de l'expérience du mainteneur du site qui m'a appris les bases de cette approche.",
    "project-page-agilemans-cta-text" : "Visiter le site",


    "project-page-livrotheque-title" : "La <span>Livrothèque<span>",
    "project-page-livrotheque-subtitle" : "Un site de bibliothèque pour les lecteurs curieux !",
    "project-page-livrotheque-summary" : "Ce site fictif est un projet que j'ai mené pendant mes études. L'objectif visé ici était de développer une interface complète en full-stack. La Livrothèque propose aux utilisateurs d'emprunter les livres de la bibliothèque à travers l'interface du site. Une partie administrateur est disponible pour les gérants de la bibliothèque afin d'organiser le stock (commande, édition de livre, suppression) et les emprunts des clients.",
    "project-page-livrotheque-catch-phrase" : "Si j'ai pu développer beaucoup d'interfaces en front-end par le passé, ce projet fut ma première expérience avec le back-end.",
    "project-page-livrotheque-role-text" : "Dans un contexte d'étudiant ici, mon but était de découvrir comment lier (pour la première fois) une base de données à un site web statique. Le défi était de taille mais très enrichissant. Développer un projet complet permet de concrètement mettre en place les compétences acquises par le passé et progresser.",
    "project-page-livrotheque-process-text" : "Comme à mon habitude j'ai premièrement réalisé l'ensemble du design du site sur Figma avant de passer à l'implémentation de la base de données. Les relations étaient assez simple à mettre en place, l'objectif étant avant tout d'apprendre à intégrer cette base de données au site à l'aide de PHP. La suite du projet est assez linéaire, j'ai développé en premier toute la partie front-end statique (responsive inclus) avant d'intégrer le PHP et les requêtes SQL. Ayant encore du temps disponible avant le rendu final, j'ai pu implémenter un système de connexion avec la possibilité de mettre à jour ses informations personnelles. Un projet long à mener en solitaire, mais très enrichissant après coup.",
    "project-page-livrotheque-cta-text" : "Voir le projet sur GitHub",

    "project-page-awaketissu-title" : "Awake <span>Tissu<span>",
    "project-page-awaketissu-subtitle" : "L'application d'achat et de vente des tissus de seconde main !",
    "project-page-awaketissu-summary" : "Awake Tissu est un projet entrepreneurial mené par une amie, Samia El Farouki. Né d'une idée de lutter contre la surproduction textile, ce projet a pour objecif de développer une plateforme afin de mettre en relation les adeptes de la couture. J'ai pu développer l'ensemble du design du nouveau 'Vinted de la couture'.",
    "project-page-awaketissu-catch-phrase" : "En bientôt 5 ans de pratique de Figma, le design d'Awake Tissu est le plus conséquent que j'ai jamais réalisé.",
    "project-page-awaketissu-role-text" : "J'apprécie particulièrement l'outil Figma pour réaliser des visuels et des prototypes de sites web et d'applications. C'est donc sans hésiter que je me porté volontaire pour aider Samia à réaliser sa platforme en ligne. Le design de l'application est une étape cruciale du projet, c'est la dernière avant son développement concret. Il ne fallait rien oublier.",
    "project-page-awaketissu-process-text" : "En effet, cette maquette est la dernière étape avant le développement et le déploiement de l'application. Parti des idées et croquis de Samia, j'ai débuté une démarche UX afin d'offrir la meilleure expérience possible. Le travail a consisté en la compréhension des personas, réalisation de prototypes basse et haute fidélité ainsi que la réflexion autour des interactions. À partir de là et avec une communicaton régulière, j'ai conçu pas à pas chaque écran de l'application sur Figma. Ce projet fut une expérience très enrichissante tant au niveau de mes compétences que du plaisir pris à concevoir un projet entrepreneurial concret.",
    "project-page-awaketissu-cta-text" : "Visiter l'application (à venir)",

    "project-page-sphere-title" : "<span>SPHERE<span>",
    "project-page-sphere-subtitle" : "L'association des alumni de mon école !",
    "project-page-sphere-summary" : "SPHERE est l'association des anciens de l'ENSIM de mon école. J'y ai fait mes premiers pas en novembre 2021 à la suite de leur journée annuelle. À l'image d'AgiLeMans, j'ai réalisé la communication de l'association en créant des visuels et des posts sur les réseaux sociaux mais j'ai surtout participé à la refonte du site internet !",
    "project-page-sphere-catch-phrase" : "Une chouette collaboration pour ma première expérience avec Wordpress !",
    "project-page-sphere-role-text" : "Ici, j'ai travaillé en collaboration avec Corentin B. un membre de l'association. L'objectif était de proposer un nouveau site web performant et surtout maintenable facilement par des personnes non nécessairement développeurs.",
    "project-page-sphere-process-text" : "Le choix de la technologie s'est donc porté vers Wordpress. C'est un système de gestion de contenu gratuit, facile à intégrer à un site internet. Il permet de créer et surtout de maintenir des sites facilement à l'aide de son système de blocs de contenus. De plus, une partie blog est naturellement intégrée, ce qui permet à n'importe qui de publier des articles sans avoir à toucher une seule ligne de code. Une technologie pratique qui permet donc de concevoir des sites / blogs rapidement. Néanmoins, ayant l'habitude de développer chacun de mes sites à la main, j'ai été souvent frustré du manque de personnalisation qu'offrait l'outil.",
    "project-page-sphere-cta-text" : "Visiter le site",

    "project-page-vavart-title" : "<span>Vavart<span>",
    "project-page-vavart-subtitle" : "Un bot discord pour organiser vos parties privées sur Rainbow Six : Siege !",
    "project-page-vavart-summary" : "Quand on retrouve ses amis pour jouer, ce n'est pas pour passer 20 minutes à discuter des équipes, de la carte sur laquelle jouer ou encore de comment se séparer vocalement pour ne pas entendre les autres ! Vavart est la solution à tout cela, il permet d'automatiser la création de parties privées de Rainbow Six : Siege (R6) sur discord en générant une carte et des équipes aléatoires. Il permet même à l'aide d'une commande de séparer vocalement les deux équipes dans des salons différents et de les ramener ensemble à la fin de la partie. De quoi facilement jouer une partie supplémentaire !",
    "project-page-vavart-catch-phrase" : "Une première expérience avec discord.js qui ouvre des portes sur d'autres manières d'utiliser les langages web.",
    "project-page-vavart-role-text" : "J'avais remarqué que l'on passait beaucoup (trop) de temps à s'organiser pour jouer ensemble entre amis. J'ai donc décidé de réaliser ce bot discord pour répondre à ce problème. Le bot se devait d'être fun et facile d'utilisation pour organiser les parties rapidement.",
    "project-page-vavart-process-text" : "Vavart est mon tout premier bot discord ! Je ne savais pas où ce projet allait me mener, je désirais simplement accélérer la création de parties privées pour jouer plus longtemps sans avoir à se prendre trop de temps pour se mettre d'accord. J'ai procédé par itérations. Le but premier était d'obtenir une première version fonctionnelle pour jouer au plus vite. C'est seulement dans une deuxième et troisième version que sont venus se greffer la mise en forme des messages et l'ajout d'autres fonctionnalités comme le déplacement des joueurs dans des salons vocaux par équipe. La conception en JavaScript était intéressante et plaisante à mettre en place, c'est un lanagage que j'aime beaucoup.",
    "project-page-vavart-cta-text" : "Voir le projet sur GitHub",

    "project-page-cineflix-title" : "<span>Cineflix<span>",
    "project-page-cineflix-subtitle" : "Une application mobile pour rechercher, sauvegarder et trouver votre prochain film à regarder !",
    "project-page-cineflix-summary" : "Cineflix est une application mobile basée sur The Movie Database. Elle permet à ses utilisateurs de rechercher des films et de les enregistrer comme favoris. Sur chaque page de film, les utilisateurs peuvent regarder la bande-annonce et partager le film sur les réseaux sociaux et les différentes applications de messagerie. Ils peuvent également marquer le film comme regardé ou non regardé. Enfin, un modèle de recommandation est disponible dans l'application, faisant des suggestions aux utilisateurs sur la base de leurs préférences (= favoris) et des films populaires.",
    "project-page-cineflix-catch-phrase" : "Pour une première application mobile, je suis très fier du résultat !",
    "project-page-cineflix-role-text" : "Cineflix est un projet que j'ai réalisé pendant mes études, le but était de découvrir le développement mobile à travers une application complète, le tout avec une conception orientée utilisateur. J'ai pris beaucoup de plaisir à designer l'application et prendre en compte l'expérience utilisateur dans le processus. Une fois la première version terminée, j'ai eu l'occasion de la faire tester à d'autres étudiants, un excellent moyen d'obtenir des retours pour aboutir à une version vraiment satisfaisante de l'application !",
    "project-page-cineflix-process-text" : "Connaissant l'API de The Movie Database, je souhaitais proposer une application avec une bonne UX, permettant aux utilisateurs de rechercher le film qu'ils souhaitent. Le début du projet s'est donc plutôt déroulé sur Figma où j'ai maquetté l'ensemble de l'application. J'ai ensuite découvert l'environnement Flutter et le langage Dart sur lequel Flutter repose. Après avoir suivi une formation, j'ai très vite adhéré au langage, qui est probablement l'un de mes favoris ! Couplé à un environnement VsCode adapté, développer Cineflix était une bonne partie de plaisir. J'ai évidemment recontré des difficultés au long du trajet, mais elles n'ont rien enlevées à la satisfaction d'avoir développé une application ergonomique de A à Z. Je développerai volontiers d'autres applications mobiles avec Flutter dans le futur !",
    "project-page-cineflix-cta-text" : "Voir le projet sur GitHub",


    "legal-title" : "Mentions <span>légales</span>",
    "legal-edition-title" : "Édition du site Internet",
    "legal-edition-text" : "Le site https://maximesciare.com (ci-après « le Site ») est édité par Maxime Sciare (ci-après « l'Editeur »).",
    "legal-redaction-title" : "Rédaction du site Internet",
    "legal-redaction-text-1" : "Directeur de la publication : Maxime Sciare",
    "legal-redaction-text-2" : "Contact : contact@maximesciare.com",
    "legal-hosting-title" : "Hébergement du site Internet",
    "legal-hosting-text" : "Le site https://maximesciare.com est hébergé par OVH, 2 rue Kellermann, 59100 Roubaix.",
    "legal-respect-title" : "Respect de la propriété intellectuelle",
    "legal-respect-text-1" : "Toutes les marques, photographies, textes, commentaires, illustrations, images animées ou non, séquences vidéo, sons, ainsi que toutes les applications informatiques qui pourraient être utilisées pour faire fonctionner le Site et plus généralement tous les éléments reproduits ou utilisés sur le Site sont protégés par les lois en vigueur au titre de la propriété intellectuelle.",
    "legal-respect-text-2" : "Ils sont la propriété pleine et entière de l'Éditeur ou de ses partenaires, sauf mentions particulières. Toute reproduction, représentation, utilisation ou adaptation, sous quelque forme que ce soit, de tout ou partie de ces éléments, y compris les applications informatiques, sans l'accord préalable et écrit de l'Éditeur, sont strictement interdites. Le fait pour l'Éditeur de ne pas engager de procédure dès la prise de connaissance de ces utilisations non autorisées ne vaut pas acceptation desdites utilisations et renonciation aux poursuites.",
    "legal-respect-text-3" : "Seule l'utilisation pour un usage privé dans un cercle de famille est autorisée et toute autre utilisation est constitutive de contrefaçon et/ou d'atteinte aux droits voisins, sanctionnées par le Code de la propriété intellectuelle.",
    "legal-respect-text-4" : "La reprise de tout ou partie de ce contenu nécessite l'autorisation préalable de l'Éditeur ou du titulaire des droits sur ce contenu.",
    "legal-links-title" : "Liens hypertextes",
    "legal-links-text" : "Le Site peut contenir des liens hypertextes donnant accès à d'autres sites Internet édités et gérés par des tiers et non par l'Éditeur. L'Editeur ne pourra être tenu responsable directement ou indirectement dans le cas où lesdits sites tiers ne respecteraient pas les dispositions légales.",


    "footer-text" : "©2023 - Développé par mes soins avec ❤️",
    "footer-legal" : "Mentions légales"
}