{

    "lang" : "Anglais",

    "nav-link-1" : "Accueil / Projets",
    "nav-link-2" : "À propos",


    "main-page-hero-title" : "Enchanté, moi c'est <span>Maxime</span>",

    "main-page-hero-text" : "Je suis un développeur web passionné par l'expérience utilisateur. Du design initial au produit final, j'apprécie énormément concevoir des interfaces adaptées aux besoin des utilisateurs.",
    "main-page-hero-btn-text" : "Voir mes projets",
    "main-page-hero-image-caption" : "c'est moi !",
    "main-page-hero-contact-me" : "Contactez-moi ! :)",

    "main-page-testimonies-title" : "Ils m'ont fait confiance",
    "main-page-testimonies-samia-text" : "J'ai fait confiance à Maxime pour la réalisation de prototypes sur FIGMA, dans le cadre de la création de mon entreprise ! Je n'ai pas été déçue : j'ai retrouvé chez Maxime une oreille attentive, des conseils et un travail rigoureux et irréprochable ! Je recommande son travail et son professionnalisme ! Encore merci Maxime !",
    "main-page-testimonies-samia-caption" : "Samia EL FAROUKI : Fondatrice d'Awake Tissu",

    "main-page-testimonies-agilemans-text" : "Maxime s'occupa de la refonte de notre site web vieillissant cette année en utilisant des techniques plus modernes et réactives. Toute l'équipe de l'association fut enthousiasmée par le changement.",
    "main-page-testimonies-agilemans-caption" : "L'association AgiLeMans",

    "main-page-project-title" : "Mes <span>projets</span>",

    "main-page-project-agilemans-type" : "Site web vitrine",
    "main-page-project-agilemans-title" : "AgiLeMans",

    "main-page-project-livrotheque-type" : "Emprunts de livres",
    "main-page-project-livrotheque-title" : "La Livrothèque",

    "main-page-next-page-text" : "Vous souhaitez en savoir plus sur moi ?",

    "about-page-hero-title" : "Je suis (bientôt) ingénieur spécialisé en <span>interactions</span> personne / système",
    "about-page-hero-text" : "Actuellement en 4ème année d'études d'ingénierie informatique, j'apprends aussi beaucoup en autonomie. J'aime lire et acquérir de nouvelles connaisances chaque jour, toujours dans le but de m'améliorer. Enfin, je me suis donné pour mission de faciliter la vie des utilisateurs, afin de leur permettre de progresser et de gagner du temps.",
    "about-page-hero-in-short" : "En résumé :",
    "about-page-hero-in-short-text" : "Développer des interfaces qui font <span>sens</span> grâce à ...",
    "about-page-hero-tag-1-title" : "#web",
    "about-page-hero-tag-1-text" : "Mon univers de développement préféré !",
    "about-page-hero-tag-2-title" : "#gaming",
    "about-page-hero-tag-2-text" : "Je suis tombé dedans quand j'étais petit !",
    "about-page-hero-tag-3-title" : "#entrepreneurship",
    "about-page-hero-tag-3-text" : "Si vous saviez à quel point j'aime créer des choses ...",
    "about-page-hero-tag-4-title" : "#ergonomie",
    "about-page-hero-tag-4-text" : "Si chacun y pense, le monde ira dans le bon sens !",
    "about-page-hero-tag-5-title" : "#responsive",
    "about-page-hero-tag-5-text" : "Il faut que ça rende bien sur téléphone !",
    "about-page-hero-tag-6-title" : "#agilite",
    "about-page-hero-tag-6-text" : "Des principes biens utiles pour une vie meilleure.",
    "about-page-hero-tag-7-title" : "#uxdesign",
    "about-page-hero-tag-7-text" : "La satisfaction du client est la priorité !",
    "about-page-hero-tag-8-title" : "#developpeur",
    "about-page-hero-tag-8-text" : "Malgré ce que je peux en dire, j'adore toujours autant ça !",
    "about-page-hero-tag-9-title" : "#lecture",
    "about-page-hero-tag-9-text" : "Si tu as un problème, quelqu'un a sûrement déjà écrit à ce sujet !",
    "about-page-hero-tag-10-title" : "#vision",
    "about-page-hero-tag-10-text" : "Pour être toujours sûr d'avancer dans la bonne direction !",


    "about-page-skills-title" : "Mes compétences",
    "about-page-skills-languages-text" : "Les <span>langages</span> et <span>frameworks</span> que je pratique",
    "about-page-skills-tools-text" : "Mes <span>outils</span> principaux (web & design)",
    "about-page-skills-soft-title" : "Mes <span>soft</span> skills",
    "about-page-skills-soft-1" : "Pérsévérance",
    "about-page-skills-soft-2" : "Empathie",
    "about-page-skills-soft-3" : "Créativité",
    "about-page-skills-soft-4" : "Communication",
    "about-page-skills-soft-5" : "Leadership",
    "about-page-skills-soft-6" : "Think out of the box",
    "about-page-skills-soft-7" : "Esprit d'équipe",
    "about-page-skills-soft-8" : "Esprit critique",
    "about-page-skills-soft-9" : "Curiosité",
    "about-page-skills-hard-title" : "Mes <span>hard</span> skills",
    "about-page-skills-hard-1" : "Team work",
    "about-page-skills-hard-2" : "Agilité, Scrum, SAFe",
    "about-page-skills-hard-3" : "Entrepreneuriat",
    "about-page-skills-hard-4" : "UX/UI Design",
    "about-page-skills-hard-5" : "UX Writing",
    "about-page-skills-hard-6" : "Maquettage web",
    "about-page-skills-hard-7" : "Programmation web",
    "about-page-skills-hard-8" : "Intégration continue",
    "about-page-skills-hard-9" : "Responsive design",
    "about-page-skills-contact-title" : "Me contacter",
    "about-page-skills-contact-btn-linkedin" : "Voir le profil LinkedIn",
    "about-page-skills-contact-btn-cv" : "Télécharger le CV",
    "about-page-next-page-text" : "On retourne voir mes projets ?",


    "project-page-role" : "Mon rôle",
    "project-page-process" : "Déroulement",
    "project-page-techs" : "Technologies & outils",
    "project-page-next-page" : "Revenir à mes projets ?",


    "project-page-agilemans-title" : "<span>AgiLeMans<span>",
    "project-page-agilemans-subtitle" : "Les journées de l'agilité en Sarthe !",
    "project-page-agilemans-summary" : "AgiLeMans est une association qui vante les mérites et bienfaits de l'agilité en Sarthe. Chaque année, l'association organise sa journée Agile où des centaines de personnes viennent découvrir ou re-découvrir des méthodes pour être plus heureux et plus performant au travail. Je fais partie d'AgiLeMans depuis 2021 où j'ai réalisé une bonne partie de leur communication ainsi que ce site web (lien en bas de page).",
    "project-page-agilemans-catch-phrase" : "Le site web d'AgiLemans représentait un sacré défi pour moi, n'ayant aucune connaissance en intégration continue. Je me lançais un peu dans l'inconnu",
    "project-page-agilemans-role-text" : "L'objectif était de mettre au goût du jour l'ancien site web de l'association en proposant un style neuf et ergonomique tout en facilitant sa gestion par les membres de l'asocciation. Une attention toute particulière était portée à l'adaptation du site sur différents types d'écrans (responsive) et à la vitesse de celui-ci.",
    "project-page-agilemans-process-text" : "J'ai premièrement réalisé l'ensemble du design sur Figma comme à mon habitude avant de justifier à l'association la technologie que j'allais utiliser, Next.js. Ce framework JavaScript est en effet la première chose à laquelle j'ai pensé pour répondre au critère de rapidité. Il ajoute à React l'optimisation des images et les rendus de page statiques. Au lieu d'hydater le site dynamiquement à l'aide de JavaScript, des pages HTML statiques sont générés, permettant par la même occasion de mieux indexer le site sur les moteurs de recherche. De quoi faire connaître AgiLeMans au plus grand nombre !",
    "project-page-agilemans-cta-text" : "Visiter le site",


    "project-page-livrotheque-title" : "La <span>Livrothèque<span>",
    "project-page-livrotheque-subtitle" : "Un site de bibliothèque pour lecteurs curieux !",
    "project-page-livrotheque-summary" : "Ce site fictif est un projet que j'ai mené pendant mes études. L'objectif visé ici était de développer une interface complète en full-stack. La Livrothèque propose aux utilisateurs d'emprunter les livres de la bibliothèque à travers l'interface du site. Une interface administrateur est disponible pour les gérants de la bibliothèque, leur donnant la possibilité de gérer le stock (commande, édition de livre, suppression) et les emprunts des clients.",
    "project-page-livrotheque-catch-phrase" : "Si j'avais pu développer beaucoup d'interfaces en front-end par le passé, ce projet fut ma première expérience avec le back-end.",
    "project-page-livrotheque-role-text" : "Dans un contexte d'étudiant ici, mon but était de découvrir comment lier (pour la première fois) une base de données à un site web statique. Le défi était de taille mais très enrichissant. Développer un projet complet permet de concrètement mettre en place les compétences acquises par le passé et de progresser.",
    "project-page-livrotheque-process-text" : "Comme à mon habitude j'ai premièrement réalisé l'ensemble du design du site sur Figma avant de passer à l'implémentation de la base de données. Les relations étaient assez simple à mettre en place, l'objectif étant avant tout d'apprendre à intégrer cette base de données au site à l'aide de PHP. La suite du projet est assez linéaire, j'ai développé en premier toute la partie front-end (responsive inclus) avant d'intégrer le PHP et les requêtes SQL. Ayant encore du temps disponible avant le rendu final, j'ai pu implémenter un système de connexion avec la possibilité de mettre à jour ses informations personnelles. Un projet long à mener en solitaire, mais très enrichissant après coup.",
    "project-page-livrotheque-cta-text" : "Voir le projet sur GitHub",


    "legal-title" : "Mentions <span>légales</span>",
    "legal-edition-title" : "Édition du site Internet",
    "legal-edition-text" : "Le site https://maximesciare.com (ci-après « le Site ») est édité par Maxime Sciare.",
    "legal-redaction-title" : "Rédaction du site Internet",
    "legal-redaction-text-1" : "Directeur de la publication : Maxime Sciare",
    "legal-redaction-text-2" : "Contact : bonjour@maximesciare.com",
    "legal-hosting-title" : "Hébergement du site Internet",
    "legal-hosting-text" : "Le site https://maximesciare.com est hébergé par OVH, 2 rue Kellermann, 59100 Roubaix.",
    "legal-respect-title" : "Respect de la propriété intellectuelle",
    "legal-respect-text-1" : "Toutes les marques, photographies, textes, commentaires, illustrations, images animées ou non, séquences vidéo, sons, ainsi que toutes les applications informatiques qui pourraient être utilisées pour faire fonctionner le Site et plus généralement tous les éléments reproduits ou utilisés sur le Site sont protégés par les lois en vigueur au titre de la propriété intellectuelle.",
    "legal-respect-text-2" : "Ils sont la propriété pleine et entière de l'Éditeur ou de ses partenaires, sauf mentions particulières. Toute reproduction, représentation, utilisation ou adaptation, sous quelque forme que ce soit, de tout ou partie de ces éléments, y compris les applications informatiques, sans l'accord préalable et écrit de l'Éditeur, sont strictement interdites. Le fait pour l'Éditeur de ne pas engager de procédure dès la prise de connaissance de ces utilisations non autorisées ne vaut pas acceptation desdites utilisations et renonciation aux poursuites.",
    "legal-respect-text-3" : "Seule l'utilisation pour un usage privé dans un cercle de famille est autorisée et toute autre utilisation est constitutive de contrefaçon et/ou d'atteinte aux droits voisins, sanctionnées par le Code de la propriété intellectuelle.",
    "legal-respect-text-4" : "La reprise de tout ou partie de ce contenu nécessite l'autorisation préalable de l'Éditeur ou du titulaire des droits sur ce contenu.",
    "legal-links-title" : "Liens hypertextes",
    "legal-links-text" : "Le Site peut contenir des liens hypertextes donnant accès à d'autres sites Internet édités et gérés par des tiers et non par l'Éditeur. L'Editeur ne pourra être tenu responsable directement ou indirectement dans le cas où lesdits sites tiers ne respecteraient pas les dispositions légales.",


    "footer-text" : "©2023 - Développé par mes soins avec ❤️",
    "footer-legal" : "Mentions légales"
}